CAFA_SST/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
#include "../../constant/flowProperties"

flowVelocity         ${flowVelocity};
pressure             0;
turbulentKE          0.06;
turbulentOmega       400;

// ************************************************************************* //
